


#  TODO  机器人运行信息   ----------------
run_status = {'1110': '正在执行', '1111': '待执行', '1112': '未执行',
              '1113': '完成', '1114': '异常终止', '1115': '失败',
              '1116': '删除', '1117': '彻底删除', '1118':'成功'}


# TODO  机器人信息        ----------------
robot_name =  {
    '采购申请机器人':'purchase_requisition_RPA_Yes',
    '个税机器人':'GeShui'
}

# TODO  货物信息          ----------------
goods_numbers = {'002': '封边条', '003': 'A产品配件',
                 '004': 'B产品配件', '007': '包装箱',
                 '008': '工具', '009': '手套',
                 '010': '工作服'}
