


#  TODO  机器人运行信息   ----------------
run_status = {'1110': '正在执行', '1111': '待执行', '1112': '未执行',
              '1113': '完成', '1114': '异常终止', '1115': '失败',
              '1116': '删除', '1117': '彻底删除', '1118':'成功'}


# TODO  机器人信息        ----------------
robot_name =  {
    '采购申请机器人':'purchase_requisition_RPA_NoOCR',
    '个税机器人':'GeShui',
    '采购合同机器人':'purchase_order_RPA',
    '销售合同机器人':'sale_RPA',
}

# TODO  货物信息          ----------------
goods_numbers = {'201': 'A板材', '202': 'B板材',
                 '203': 'X铸管', '204': 'a配件',
                 '205': 'b配件', '206': '包装箱',
                 '207':'工具','208':'手套','209':'工作服'}

# TODO  仓库名称
warehouse_name = {
    '100':'成品库',
    '200':'材料库',
}




# TODO  公司信息
company_info  = {
    '1001':'光明钢材生产有限公司',
    '1002':'东方五金生产有限公司',
    '1003':'宏泰钢材生产有限公司',
    '1004':'西平钢材生产有限公司',
    '1005':'立方钢材生产有限公司',
    '1006':'京东贸易有限公司',
    '1008':'安平市顺通贸易有限公司',
    '9901':'北京京东锐达商贸有限公司',
}

